Rails/RedditClone/app/controllers/application_controller.rb

    def current_user
        @cur_user ||= User.find_by(session_token: session[:session_token])
---
SELECT "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "5hRrrs54GPs9zPBZWC-fzA"], ["LIMIT", 1]]

    def must_be_author
        user = current_user
        cur_post = Post.find_by(id: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]