Rails/RedditClone/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "final comment test"], ["author_id", 13], ["post_id", 9], ["created_at", "2019-10-28 16:36:17.784617"], ["updated_at", "2019-10-28 16:36:17.784617"]]
---
    def create
        @comment = Comment.new(comment_params)
        @comment.author_id = current_user.id

        if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @comment = Comment.find_by(id: params[:id])