Rails/RedditClone/app/controllers/subs_controller.rb

    def create
        @sub = Sub.new(sub_params)
        @sub.creator_id = current_user.id
        if @sub.save
---
INSERT INTO "subs" ("title", "description", "creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "/r/all"], ["description", "for all your entertainment needs"], ["creator_id", 13], ["created_at", "2019-10-28 18:44:31.082079"], ["updated_at", "2019-10-28 18:44:31.082079"]]