Rails/NinetyNineCats/app/controllers/cat_rental_requests_controller.rb

SELECT "cats".* FROM "cats"
---
	def new
		@cats = Cat.all

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 36], ["start_date", "2019-10-10"], ["end_date", "2019-12-10"], ["created_at", "2019-10-04 18:05:07.123609"], ["updated_at", "2019-10-04 18:05:07.123609"]]
---
	def create
		@request = CatRentalRequest.new(rental_params)

		if @request.save

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
	def approve
		@cat_request = CatRentalRequest.find_by(id: params[:id])