Rails/ArtShare/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 13], ["viewer_id", 5]]
---
	def create
		share = ArtworkShare.new(artwork_share_params)
		if share.save

SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def find_share_by_id
		ArtworkShare.find(params[:id])