Rails/ArtShare/app/controllers/artworks_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
	def index
		user = User.find(params[:user_id])