Rails/NinetyNineCats/app/models/cat_rental_request.rb

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" != $1 AND "cat_rental_requests"."cat_id" = $2 AND NOT (start_date > '2019-10-15' OR end_date < '2019-10-12') AND "cat_rental_requests"."status" = $3  [["id", 26], ["cat_id", 46], ["status", "PENDING"]]
SELECT 1 AS one FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" != $1 AND "cat_rental_requests"."cat_id" = $2 AND NOT (start_date > '2019-10-15' OR end_date < '2019-10-12') AND "cat_rental_requests"."status" = $3 LIMIT $4  [["id", 20], ["cat_id", 40], ["status", "APPROVED"], ["LIMIT", 1]]
---
	def does_not_overlap_approved_request
		if overlapping_approved_requests.exists? && self.status == 'APPROVED'

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2019-10-04 22:58:09.406184"], ["id", 26]]
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2019-10-04 23:01:50.049402"], ["id", 28]]
---
	def approve!
		self.status = 'APPROVED'
		CatRentalRequest.transaction do
			self.save!
			overlapping_pending_requests.each do |pending_to_denied|
				pending_to_denied.status = 'DENIED'
				pending_to_denied.save!