Rails/NinetyNineCats/app/views/cats/show.html.erb

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 ORDER BY "cat_rental_requests"."start_date" DESC  [["cat_id", 33]]
---

<% @cat.rental_requests.order(start_date: :desc).each do |request| %>