Rails/RedditClone/app/models/post.rb

    def comments_by_parent_id
        all_post_comments = self.comments.includes(:author)
        hash_by_parent_id = Hash.new { |h,k| h[k] = [] }
        all_post_comments.each do |comment|
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 10]]